Question 1

database is a software that is used to store data . in this it provide  insertion ,deletion , updatation.

SQL stands for structrued query language 
sql is relational query language
schema of sql is fixed
sql is vertically scalabile

NOSQL 
it is non relational query language 
it is not fixed schema 
it horizontall scalabile

Question 2

DDL : data defination language  it is set of SQL command that can create drop alter and truncate

create is used to create new rows or column or table

CREATE TABLE student (
    ID int,
    name varchar(255),
    marks  decimal(10, 2)
);

 drop used to delete a database object, such as a table

DROP TABLE student;

alter used to modify the structure of an existing database object

ALTER TABLE student ADD COLUMN email varchar(255);

truncate  is used to delete all data from a table, but not the table itself

TRUNCATE TABLE student;

DML it stand for data munipulation language 
it is set of SQl commond in which insertion , updation , delete

insert command is used new rows or column or table

INSERT INTO Employees (EmployeeID, FirstName, LastName, Department)
VALUES (1001, 'John', 'Doe', 'Sales');

update is used update the rows or column

UPDATE Employees
SET Department = 'Marketing'
WHERE EmployeeID = 1001;

this statement is used to delete data from a table

DELETE FROM Employees
WHERE EmployeeID = 1001;

Question 4

DQL stands for data query language 
it is used to retrive data from the  database

 select is used retrieves data from a table or tables and displays it in the form of a result set

SELECT * FROM Students;

SELECT FirstName, LastName FROM Students;

Question 5

A primary key is a column or set of columns in a relational database table that uniquely identifies each row or record in that table. It acts as a unique identifier for each record, and no two records in the table can have the same primary key value.

A foreign key, on the other hand, is a column or set of columns in a table that references the primary key of another table. It is used to establish a relationship between two tables in a relational database. By referencing the primary key of another table, the foreign key ensures that the data in the referencing table is consistent with the data in the referenced table

Question 6

import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="yourusername",
  password="yourpassword",
  database="yourdatabase"
)

mycursor = mydb.cursor()


mycursor.execute("SELECT * FROM yourtable")

myresult = mycursor.fetchall()
for x in myresult:
  print(x)

The cursor() method creates a new cursor object that can be used to interact with the database.

The execute() method is used to execute an SQL query. It takes a string as a parameter that contains the SQL query.

Question 7

1. FROM 
2. JOIN
3. WHERE 
4. GROUP BY